resources/e2eTestData.json

{
    "paymentModels": {
        "insertPaymentModel": {
            "merchantID": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 0,
            "trialPeriod": 0,
            "currency": "EUR",
            "numberOfPayments": 1,
            "frequency": 10,
            "typeID": 1,
            "networkID": 3,
            "automatedCashOut": false,
            "cashOutFrequency": 0
        },
        "patchPaymentModel": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 0,
            "trialPeriod": 0,
            "currency": "EUR",
            "numberOfPayments": 1,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3,
            "automatedCashOut": true,
            "cashOutFrequency": 1
        },
        "updatePaymentModel": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 23,
            "trialPeriod": 23,
            "currency": "EUR",
            "numberOfPayments": 5,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3,
            "automatedCashOut": true,
            "cashOutFrequency": 1
        },
        "getPaymentModel": {
            "pullPaymentModelID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        },
        "deletePaymentModel": {
            "pullPaymentModelID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        }
    },
    "payments": {
        "insertTestPayment": {
            "pullPaymentModelID": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "numberOfPayments": 4,
            "startTimestamp": 100,
            "customerAddress": "0x0000000000000000000000000000000000000000",
            "pullPaymentAddress": "0x0000000000000000000000000000000000000000",
            "userID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        },
        "updateTestPayment": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "hdWalletIndex": 0,
            "numberOfPayments": 5,
            "nextPaymentDate": 10,
            "lastPaymentDate": 20,
            "startTimestamp": 100,
            "statusID": 1,
            "userID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        },
        "getTestPayment": {
            "paymentID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        },
        "deleteTestPayment": {
            "paymentID": "23c534fe-8c97-11e8-b47f-9a38301a1e03"
        }
    },
    "transactions": {
        "getTestTransaction": {
            "transactionHash": "0x5001eb375228166ec3be82299524d8c4e8bb6aa3c368d71829ae234e7947e39d",
            "pullPaymentID": "23c534fe-8c97-11e8-b47f-9a38301a1e03",
            "statusID": 1,
            "typeID": 2
        },
        "createTestTransaction": {
            "hash": "0xn9jaj46edm5oplfq6m8ta96221553588139c14ios01gqp5jcpqms3eo8m1r4mtl",
            "paymentID": "82150f2c-c325-11e8-b3bc-2b0173837727",
            "typeID": 2,
            "timestamp": 15381442010077
        }
    },
    "scheduler": {
        "stopSqcheduler": {
            "paymentID": "24947f2e-9164-11e8-bc8e-27e75bf6baf4"
        }
    },
    "qrValidator": {
        "getQrValidator": {
            "paymentID": "24947f2e-9164-11e8-bc8e-27e75bf6baf4"
        },
        "qrValidatorForEther": {
            "address": "0xa9acc3a896548b6afb4e94c0731b04a2982f3c9c",
            "value": "23c534fe8c9711e8b47f9a38301a1e03",
            "gas": 354
        },
        "qrValidatorForErc20": {
            "tokenAddress": "0x11c1e537801cc1c37ad6e1b7d0bdc0e00fcc6dc1",
            "address": "0xa9acc3a896548b6afb4e94c0731b04a2982f3c9c",
            "value": "32458723409853475",
            "gas": 354
        }
    }
}